results/routeA/initialization_check/A-Ra1e3-coarse/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.0001759683098591549
-0.0005279049295774647
-0.0008798415492957747
-0.001231778169014084
-0.001583714788732394
-0.001935651408450704
-0.002287588028169014
-0.002639524647887324
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.0001761443661971831
-0.0005284330985915493
-0.0008807218309859155
-0.001233010563380282
-0.001585299295774648
-0.001937588028169014
-0.00228987676056338
-0.002642165492957746
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -0.01408450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
