results/routeA/initialization_check/A-Ra1e3-coarse/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
0
0
2.710505431213761e-20
-2.710505431213761e-20
0
-2.710505431213761e-20
0
5.421010862427522e-20
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
0
2.168404344971009e-19
2.168404344971009e-19
2.168404344971009e-19
2.168404344971009e-19
2.168404344971009e-19
0
0
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
2.710505431213761e-20
1.084202172485504e-19
2.168404344971009e-19
0
-2.168404344971009e-19
-4.336808689942018e-19
-4.336808689942018e-19
0
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
1.734723475976807e-18
3.469446951953614e-18
3.469446951953614e-18
3.469446951953614e-18
3.469446951953614e-18
3.469446951953614e-18
0
3.469446951953614e-18
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
