results/routeA/initialization_check/A-Ra1e3-coarse/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-0.000176056338028169
-0.000176056338028169
-0.0001760563380281691
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
-0.000176056338028169
-0.0001760563380281691
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.000176056338028169
-0.0005281690140845072
-0.0008802816901408453
-0.001232394366197183
-0.001584507042253521
-0.001936619718309859
-0.002288732394366197
-0.002640845070422535
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.0001760563380281691
-0.0005281690140845072
-0.0008802816901408453
-0.001232394366197183
-0.001584507042253521
-0.001936619718309859
-0.002288732394366197
-0.002640845070422535
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
-0.01408450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
